Documents/абс_Экспедиция/абс_Экспедиция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_Экспедиция</name>
  <basedOn>Document.абс_ТранспортныйМаршрут</basedOn>
  <basedOn>Document.абс_ЗаявкаНаТранспорт</basedOn>
  <registerRecords>AccumulationRegister.абс_ЗатратыПоЭкспедиции</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетаТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСчетаТК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаемныйТранспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспедиторскаяРасписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АктВыполненныхРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаАкта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерЗадания</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортныйМаршрут</name>
      <type>
        <types>DocumentRef.абс_ТранспортныйМаршрут</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доля</name>
      <comment>Доля расходов от суммы счета транспортной компании</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AccumulationRegisters/абс_ЗатратыПоЭкспедиции/абс_ЗатратыПоЭкспедиции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_ЗатратыПоЭкспедиции</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Доля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаТранспорт</name>
    <type>
      <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортныйМаршрут</name>
    <type>
      <types>DocumentRef.абс_ТранспортныйМаршрут</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Documents/абс_ЗаявкаНаТранспорт/абс_ЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаТранспорт</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактыОтветственногоМенеджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.абс_Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.абс_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставкиКонтрагента</name>
    <type>
      <types>CatalogRef.абс_СпособыДоставкиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоМоноПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТКНазначения</name>
    <comment>Транспортная компания назначения</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПромежуточный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоМиксПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <types>CatalogRef.Номенклатура</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_СводнаяЗаявкаНаТранспорт/абс_СводнаяЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СводнаяЗаявкаНаТранспорт</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршруты</name>
    <attributes>
      <name>ТранспортныйМаршрут</name>
      <type>
        <types>DocumentRef.абс_ТранспортныйМаршрут</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаТранспорт</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_Экспедиция/ObjectModule.bsl
Процедура РаспределитьРасходы() Экспорт
	
	Отказ = Ложь;
	ПроверкаСуммыДолейТЧЗаказы(Отказ);
	
	Если Не Отказ Тогда
		
		СуммаВсего = СуммаСчетаТК;
		ДолейВсего = 100;
		
		Для Каждого Строка Из Заказы Цикл
			
			Строка.Расходы = СуммаВсего * Строка.Доля / ДолейВсего;
			СуммаВсего = СуммаВсего - Строка.Расходы;
			ДолейВсего = ДолейВсего - Строка.Доля;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверкаСуммыДолейТЧЗаказы(Отказ)
	
	Если Заказы.Количество() И Заказы.Итог("Доля") <> 100 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сумма долей расходов (колонка ""%"") ТЧ Заказы должна равняться 100";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//--------(1)Движения по регистру абс_ЗатратыПоЭкспедиции----------
	Движения.абс_ЗатратыПоЭкспедиции.Очистить();
	Движения.абс_ЗатратыПоЭкспедиции.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	абс_ЭкспедицияЗаказы.НомерЗадания КАК Заявка,
	               |	СУММА(абс_ЭкспедицияЗаказы.Расходы) КАК Расходы,
	               |	абс_ЭкспедицияЗаказы.ТранспортныйМаршрут,
	               |	абс_ЭкспедицияЗаказы.Ссылка.ТранспортнаяКомпания,
	               |	абс_ЭкспедицияЗаказы.Контрагент,
	               |	СУММА(абс_ЭкспедицияЗаказы.СуммаДокумента) КАК СуммаДокумента,
	               |	абс_ЭкспедицияЗаказы.Доля
	               |ПОМЕСТИТЬ ВТРасходыПоЗаявкам
	               |ИЗ
	               |	Документ.абс_Экспедиция.Заказы КАК абс_ЭкспедицияЗаказы
	               |ГДЕ
	               |	абс_ЭкспедицияЗаказы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	абс_ЭкспедицияЗаказы.НомерЗадания,
	               |	абс_ЭкспедицияЗаказы.ТранспортныйМаршрут,
	               |	абс_ЭкспедицияЗаказы.Ссылка.ТранспортнаяКомпания,
	               |	абс_ЭкспедицияЗаказы.Контрагент,
	               |	абс_ЭкспедицияЗаказы.Доля
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТРасходыПоЗаявкам.Заявка,
	               |	МАКСИМУМ(ВТРасходыПоЗаявкам.Расходы) КАК Расходы,
	               //|	СУММА(ЕСТЬNULL(абс_ЗаявкаНаТранспортТовары.Объем, 0)) КАК Объем,
				   
				   |    МАКСИМУМ(абс_ЗаявкаНаТранспортТовары.ссылка.ВсегоКоличествоПалет) КАК Объем,
				   
	               |	СУММА(ЕСТЬNULL(абс_ЗаявкаНаТранспортТовары.ВесБрутто, 0)) КАК Вес,
	               |	абс_ЗаявкаНаТранспортТовары.Ссылка.Подразделение,
	               |	ВТРасходыПоЗаявкам.ТранспортныйМаршрут,
	               |	ВТРасходыПоЗаявкам.ТранспортнаяКомпания,
	               |	ВТРасходыПоЗаявкам.Контрагент,
	               |	МАКСИМУМ(ВТРасходыПоЗаявкам.СуммаДокумента) КАК СуммаДокумента,
	               |	ВТРасходыПоЗаявкам.Доля
	               |ИЗ
	               |	ВТРасходыПоЗаявкам КАК ВТРасходыПоЗаявкам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ЗаявкаНаТранспорт.Товары КАК абс_ЗаявкаНаТранспортТовары
	               |		ПО (абс_ЗаявкаНаТранспортТовары.Ссылка = ВТРасходыПоЗаявкам.Заявка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТРасходыПоЗаявкам.Заявка,
	               |	абс_ЗаявкаНаТранспортТовары.Ссылка.Подразделение,
	               |	ВТРасходыПоЗаявкам.ТранспортныйМаршрут,
	               |	ВТРасходыПоЗаявкам.ТранспортнаяКомпания,
	               |	ВТРасходыПоЗаявкам.Контрагент,
	               |	ВТРасходыПоЗаявкам.Доля";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.абс_ЗатратыПоЭкспедиции.Добавить();
		Движение.Период           	  = Дата;
		Движение.Организация      	  = Организация;
		Движение.ЗаявкаНаТранспорт 	  = Выборка.Заявка;
		Движение.Сумма            	  = Выборка.Расходы;
		Движение.Вес              	  = Выборка.Вес;
		Движение.Объем            	  = Выборка.Объем;
		Движение.Подразделение	  	  = Выборка.Подразделение;
		Движение.ТранспортнаяКомпания = Выборка.ТранспортнаяКомпания;
		Движение.ТранспортныйМаршрут  = Выборка.ТранспортныйМаршрут;
		Движение.Контрагент			  = Выборка.Контрагент;
		Движение.Доля				  = Выборка.Доля;
		
	КонецЦикла;
	//\\------Конец (1)------------------------------------------------
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//проверка суммы долей ТЧ Заказы
	ПроверкаСуммыДолейТЧЗаказы(Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.абс_ТранспортныйМаршрут") Тогда
		
		Организация = ДанныеЗаполнения.Организация;
		ТранспортнаяКомпания = ДанныеЗаполнения.ТКПеревозчик;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт КАК НомерЗадания,
		|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Контрагент КАК Контрагент,
		|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.СуммаДокумента КАК СуммаДокумента,
		|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут
		|ИЗ
		|	Документ.абс_СводнаяЗаявкаНаТранспорт.Маршруты КАК абс_СводнаяЗаявкаНаТранспортМаршруты
		|ГДЕ
		|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут = &ТранспортныйМаршрут";  
		Запрос.УстановитьПараметр("ТранспортныйМаршрут", ДанныеЗаполнения); 
		
		Результат = Запрос.Выполнить();     
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Заказы.Очистить();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = Заказы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.абс_ЗаявкаНаТранспорт") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	абс_ЗаявкаНаТранспорт.Ссылка КАК НомерЗадания,
		|	абс_ЗаявкаНаТранспорт.Контрагент,
		|	абс_ЗаявкаНаТранспорт.СуммаДокумента,
		|	ЕСТЬNULL(абс_ТранспортныйМаршрутЗадания.Ссылка, ЗНАЧЕНИЕ(Документ.абс_ТранспортныйМаршрут.ПустаяСсылка)) КАК ТранспортныйМаршрут,
		|	абс_ЗаявкаНаТранспорт.Организация,
		|	ЕСТЬNULL(абс_ТранспортныйМаршрутЗадания.Ссылка.ТКПеревозчик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ТранспортнаяКомпанияУдалитьДоИзменения,
		|	ЕСТЬNULL(абс_ЗаявкаНаТранспорт.СпособДоставкиКонтрагента.ТК2, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ТранспортнаяКомпания
		|ИЗ
		|	Документ.абс_ЗаявкаНаТранспорт КАК абс_ЗаявкаНаТранспорт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
		|		ПО (абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт = абс_ЗаявкаНаТранспорт.Ссылка)
		|ГДЕ
		|	абс_ЗаявкаНаТранспорт.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Выборка = Запрос.Выполнить().Выбрать();
				
		Если Выборка.Следующий() Тогда
			Организация = Выборка.Организация;
			ТранспортнаяКомпания = Выборка.ТранспортнаяКомпания;
			
			Заказы.Очистить();
			
            НоваяСтрока = Заказы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
